app/controllers/book_comments_controller.rb

	def create
		@book = Book.find(params[:book_id])
		@book_comment = BookComment.new(book_comment_params)
		@book_comment.book_id = @book.id
		@book_comment.user_id = current_user.id
		@book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-12-09 03:26:11.147281"], ["updated_at", "2021-12-09 03:26:11.147281"]]

	def destroy
		@book = Book.find(params[:book_id])
  	book_comment = @book.book_comments.find(params[:id])
		book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["book_id", 2], ["id", 7], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 7]]