app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "thpvac0zc"], ["introduction", "xsryvng5q8g6fj3pyhd"], ["updated_at", "2021-12-09 03:23:11.530178"], ["id", 2]]